 Create a Series objects using NumPy's linspace and random functions.

In [2]:
import pandas as pd
import numpy as np

In [3]:
# Use Linspace to create a Series with your own num (num: Number of samples to generate and default it is 50)
# np. Linspace (start, stop, nam-50, endpoint-True, retstep=False, dtype=None, axis=0)

In [5]:
sample_50 = np.linspace(1, 10)
sample_50[:10]

array([1.        , 1.18367347, 1.36734694, 1.55102041, 1.73469388,
       1.91836735, 2.10204082, 2.28571429, 2.46938776, 2.65306122])

In [7]:
#Pass the above samples to create a Series
series_1 = pd.Series(sample_50)
print(series_1.head())

0    1.000000
1    1.183673
2    1.367347
3    1.551020
4    1.734694
dtype: float64

In [8]:
samples = np.linspace(1, 10, 5)
samples

array([ 1.  ,  3.25,  5.5 ,  7.75, 10.  ])

In [9]:
series = pd.Series(samples)
print(series)

0     1.00
1     3.25
2     5.50
3     7.75
4    10.00
dtype: float64

In [10]:
#use NumPy's random function to create a Series with some random values

In [11]:
random = np.random.rand(10)
random

array([0.15652917, 0.59542577, 0.90565072, 0.0186914 , 0.27475121,
       0.43983608, 0.48626195, 0.91193285, 0.15742056, 0.19497056])

In [12]:
ser_2 = pd.Series(random)
print(ser_2)

0    0.156529
1    0.595426
2    0.905651
3    0.018691
4    0.274751
5    0.439836
6    0.486262
7    0.911933
8    0.157421
9    0.194971
dtype: float64

Create a series using a list of elements

In [13]:
list_elements = [1,2,3,4,5,6,7,8,9,10]

In [14]:
ser_3 = pd.Series(list_elements)
ser_3

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

 For the data given below, get the index and values after forming a Series object.

In [16]:
Data = {"India": "New Delhi", "Japan": "Tokyo", "UK": "London"}
ser_data = pd.Series (Data)
ser_data

India    New Delhi
Japan        Tokyo
UK          London
dtype: object

In [17]:
ser_data.index

Index(['India', 'Japan', 'UK'], dtype='object')

In [18]:
ser_data.values

array(['New Delhi', 'Tokyo', 'London'], dtype=object)

Create a Series using a range of 10 values and specify the index explicitly. Use capital alphabets to index explicitly.

In [22]:
 values = np.arange(10)
values

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [23]:
index_values = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J']

In [24]:
ser_explicit_index = pd.Series(values,index=index_values)
ser_explicit_index

A    0
B    1
C    2
D    3
E    4
F    5
G    6
H    7
I    8
J    9
dtype: int64

Shape and Size of the Series

In [25]:
 ser_explicit_index.shape

(10,)

In [26]:
ser_explicit_index.size

10

In [27]:
ser_explicit_index[4::3]

E    4
H    7
dtype: int64

In [28]:
ser_explicit_index[::-1]

J    9
I    8
H    7
G    6
F    5
E    4
D    3
C    2
B    1
A    0
dtype: int64

In [29]:
ser_explicit_index[::2]

A    0
C    2
E    4
G    6
I    8
dtype: int64

Convert the Series object values created back into the list of values.

In [30]:
print(type(ser_explicit_index))

<class 'pandas.core.series.Series'>

In [31]:
print(ser_explicit_index.tolist())

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [33]:
print(type(ser_explicit_index.tolist()))

<class 'list'>

Construct a Series and add data to the existing Series

In [34]:
data = ['25', '50']

In [35]:
series_before = pd.Series(data)
series_before

0    25
1    50
dtype: object

In [36]:
data_to_add = ['500','600','700']

In [37]:
series_to_append = pd.Series(data_to_add)
series_to_append

0    500
1    600
2    700
dtype: object

In [38]:
series_after = series_before.append(series_to_append)
series_after

/var/folders/cp/zzchzjw14jb8x0ffxgyywy3m0000gp/T/ipykernel_2214/882019543.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  series_after = series_before.append(series_to_append)

0     25
1     50
0    500
1    600
2    700
dtype: object

In [39]:
new_series = pd.to_numeric(series_after)
new_series

0     25
1     50
0    500
1    600
2    700
dtype: int64

In [40]:
cond = (new_series >= 100)

In [41]:
new_sorted = new_series[cond]
new_sorted

0    500
1    600
2    700
dtype: int64

Pandas DataFrame

In [42]:
exam_data = {'name': ['Arun', 'Rama', 'Kantharaj', 'James', 'Emily', 'Michael',
'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12, 10, 17, np.nan, 9, 30, 15, np. nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'd']

In [43]:
exam_df = pd.DataFrame(exam_data , index=labels)
exam_df

        name  score  attempts qualify
a       Arun   12.0         1     yes
b       Rama   10.0         3      no
c  Kantharaj   17.0         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   30.0         3     yes
g    Matthew   15.0         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
d      Jonas   19.0         1     yes

In [44]:
exam_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to d
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [45]:
cond_score = ( exam_df['score'] > 12)

In [46]:
exam_df.loc[cond_score]

        name  score  attempts qualify
c  Kantharaj   17.0         2     yes
f    Michael   30.0         3     yes
g    Matthew   15.0         1     yes
d      Jonas   19.0         1     yes

In [47]:
notnull = (exam_df['score'].notnull())

In [48]:
exam_df[notnull]

        name  score  attempts qualify
a       Arun   12.0         1     yes
b       Rama   10.0         3      no
c  Kantharaj   17.0         2     yes
e      Emily    9.0         2      no
f    Michael   30.0         3     yes
g    Matthew   15.0         1     yes
i      Kevin    8.0         2      no
d      Jonas   19.0         1     yes

In [49]:
isnull = (exam_df['score'].isnull())

In [50]:
exam_df[isnull]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [51]:
exam_df

        name  score  attempts qualify
a       Arun   12.0         1     yes
b       Rama   10.0         3      no
c  Kantharaj   17.0         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   30.0         3     yes
g    Matthew   15.0         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
d      Jonas   19.0         1     yes

In [52]:
cond_yes = (exam_df['qualify'] == 'yes')

In [54]:
exam_df[cond_yes]

        name  score  attempts qualify
a       Arun   12.0         1     yes
c  Kantharaj   17.0         2     yes
f    Michael   30.0         3     yes
g    Matthew   15.0         1     yes
d      Jonas   19.0         1     yes

In [55]:
exam_df.loc[cond_yes]

        name  score  attempts qualify
a       Arun   12.0         1     yes
c  Kantharaj   17.0         2     yes
f    Michael   30.0         3     yes
g    Matthew   15.0         1     yes
d      Jonas   19.0         1     yes

In [56]:
cond_no = (exam_df['qualify'] == 'no')

In [58]:
exam_df.loc[cond_no]

    name  score  attempts qualify
b   Rama   10.0         3      no
d  James    NaN         3      no
e  Emily    9.0         2      no
h  Laura    NaN         1      no
i  Kevin    8.0         2      no

In [59]:
list_columns = ['name', 'attempts','qualify']

In [60]:
new_df = exam_df[list_columns]
new_df

        name  attempts qualify
a       Arun         1     yes
b       Rama         3      no
c  Kantharaj         2     yes
d      James         3      no
e      Emily         2      no
f    Michael         3     yes
g    Matthew         1     yes
h      Laura         1      no
i      Kevin         2      no
d      Jonas         1     yes

In [62]:
attempt_first = exam_df['attempts']
attempt_first

a    1
b    3
c    2
d    3
e    2
f    3
g    1
h    1
i    2
d    1
Name: attempts, dtype: int64

In [63]:
attempt_first.value_counts()

1    4
3    3
2    3
Name: attempts, dtype: int64

In [66]:
len(exam_df.loc[exam_df['attempts'] == 1 ])

4

In [69]:
score = exam_df['score']
score

a    12.0
b    10.0
c    17.0
d     NaN
e     9.0
f    30.0
g    15.0
h     NaN
i     8.0
d    19.0
Name: score, dtype: float64

In [70]:
score.max()

30.0